backend/controllers/SiteController.php

    public function actionIndex()
    {
         $model_delivary=BookingHeader::find()->where(['order_status'=>'Open','status'=>'Booked'])->andWhere('pickup_date <= DATE_ADD(CURDATE(), INTERVAL 3 DAY)')->orderBy(['pickup_date'=>SORT_ASC])->all();
        $model_returns=BookingHeader::find()->where(['order_status'=>'Open','status'=>'Picked'])->andWhere('return_date <= DATE_ADD(CURDATE(), INTERVAL 3 DAY)')->orderBy(['return_date'=>SORT_ASC])->all();
        $dep_pending=BookingHeader::find()->where(['order_status'=>'Open','status'=>'Returned','payment_status'=>1])->all();
        $booking_this_month=BookingHeader::find()->select(['count(*) as numb_booking','sum(rent_amount) as total'])->where('MONTH(pickup_date)=MONTH(CURRENT_DATE())')->andWhere(['order_status'=>array('Open','Cancelled','Closed')])->asArray()->one();
        $payment_cash=PaymentMaster::find()->select(['sum(amount) total'])->where(['mode_of_payment'=>'Cash'])->andWhere('MONTH(date)=MONTH(CURRENT_DATE())')->andWhere(['Not IN','type',array('Deposit','Return-Deposit')])->asArray()->one();
         $deposite_amt=PaymentMaster::find()->select(['sum(amount) total'])->where('MONTH(date)=MONTH(CURRENT_DATE())')->andWhere(['type'=>'Return-Deposit'])->asArray()->one();
         $expense=ExpenseHeader::find()->select(['sum(expense_amount) total'])->where('MONTH(expense_date)=MONTH(CURRENT_DATE())')->asArray()->one();
        //print_r($booking_this_month);die;
        $sale_monthly_summary=BookingSummary::find()->where(['year'=>date('Y')])->asArray()->all();
        $number_customer=CustomerMaster::find()->select(['count(*) total_cust','MONTH(created_on) month'])->where('YEAR(created_on)=YEAR(CURRENT_DATE())')->andWhere(['status'=>'0'])->groupBy('MONTH(created_on)')->asArray()->all();
        $number_invoice=BookingHeader::find()->select(['count(*) total_inv','MONTH(booking_date) month'])->where('YEAR(booking_date)=YEAR(CURRENT_DATE())')->groupBy('MONTH(booking_date)')->asArray()->all();
---
SELECT * FROM `booking_header` WHERE ((`order_status`='Open') AND (`status`='Booked')) AND (pickup_date <= DATE_ADD(CURDATE(), INTERVAL 3 DAY)) ORDER BY `pickup_date`
SELECT * FROM `booking_header` WHERE ((`order_status`='Open') AND (`status`='Picked')) AND (return_date <= DATE_ADD(CURDATE(), INTERVAL 3 DAY)) ORDER BY `return_date`
SELECT * FROM `booking_header` WHERE (`order_status`='Open') AND (`status`='Returned') AND (`payment_status`=1)
SELECT count(*) AS `numb_booking`, sum(rent_amount) AS `total` FROM `booking_header` WHERE (MONTH(pickup_date)=MONTH(CURRENT_DATE())) AND (`order_status` IN ('Open', 'Cancelled', 'Closed'))
SELECT sum(amount) AS `total` FROM `payment_master` WHERE (`mode_of_payment`='Cash') AND (MONTH(date)=MONTH(CURRENT_DATE())) AND (`type` NOT IN ('Deposit', 'Return-Deposit'))
SELECT sum(amount) AS `total` FROM `payment_master` WHERE (MONTH(date)=MONTH(CURRENT_DATE())) AND (`type`='Return-Deposit')
SELECT sum(expense_amount) AS `total` FROM `expense_header` WHERE MONTH(expense_date)=MONTH(CURRENT_DATE())
SELECT * FROM `booking_summary` WHERE `year`='2025'
SELECT count(*) AS `total_cust`, MONTH(created_on) AS `month` FROM `customer_master` WHERE (YEAR(created_on)=YEAR(CURRENT_DATE())) AND (`status`='0') GROUP BY MONTH(created_on)
SELECT count(*) AS `total_inv`, MONTH(booking_date) AS `month` FROM `booking_header` WHERE YEAR(booking_date)=YEAR(CURRENT_DATE()) GROUP BY MONTH(booking_date)